# Є два списка (не питонівських списка, а загалом) чисел.
# Порахувати скільки унікальних (є тільки в одному з двох)
# чисел в обох списках.
#
# Наприклад:
#   е  1, 2, 3, 4, 5 та 2, 3, 6, 8
#   унікальних чисел в обох списках: 5 (1, 4, 5, 6, 8)

N_1, N_2 = input('Введіть перший список чисел: '), input('Введіть другий список чисел: ')

N_1 = [int(i) for i in N_1.split(',')]
N_2 = [int(i) for i in N_2.split(',')]
N = N_1+N_2

N = [i for i in N if N.count(i) == 1 ]

print(f'Унікальних чисел в обох списках: {len(N)} {tuple(N)}')